# StructuralColumnAttachedToNonStructuralTarget Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..StructuralColumnAttachedToNonStructuralTarget Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The structural column is attached to a non-structural target.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralColumnAttachedToNonStructuralTarget { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralColumnAttachedToNonStructuralTarget As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralColumnAttachedToNonStructuralTarget {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace